import { LocaleConfig } from 'react-native-calendars';

LocaleConfig.locales['gr'] = {
  monthNames: [
    'Ιανουάριος',
    'Φεβρουάριος',
    'Μάρτιος',
    'Απρίλιος',
    'Μάϊος',
    'Ιούνιος',
    'Ιούλιος',
    'Άυγουστος',
    'Σεπτέμβρης',
    'Οκτώβρης',
    'Νοέμβρης',
    'Δεκέμβρης'
  ],
  monthNamesShort: ['Ιαν.', 'Φεβ.', 'Μαρ.', 'Απρ.', 'Μάϊ', 'Ιουν', 'Ιουλ.', 'Άυγ.', 'Σεπ.', 'Οκτ.', 'Νοε.', 'Δεκ.'],
  dayNames: ['Δευτέρα', 'Τρίτη', 'Τετάρτη', 'Πέμπτη', 'Παρασκευή', 'Σάββατο', 'Κυριακή'],
  dayNamesShort: ['Δευ.', 'Τρι.', 'Τετ.', 'Πεμ.', 'Παρ.', 'Σαβ.', 'Κυρ.'],
  today: "Σήμερα"
};
export default LocaleConfig.defaultLocale = 'gr'